Let's explore real payroll data of Chicago city. This data is available on kaggle website and can be downloaded using the provided link:https://www.kaggle.com/chicago/chicago-citywide-payroll-data

### Import pandas as pd

In [2]:
import pandas as pd

### Read City_of_Chicago_payroll_Data.csv as dataframe in pay

In [3]:
pay = pd.read_csv('City_of_Chicago_Payroll_Data.csv')

### Show first five records in your data.

In [4]:
pay.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

### Get the overview of your data.

In [5]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
Name                 32658 non-null object
Job Titles           32658 non-null object
Department           32658 non-null object
Full or Part-Time    32658 non-null object
Salary or Hourly     32658 non-null object
Typical Hours        7883 non-null float64
Annual Salary        24775 non-null object
Hourly Rate          7883 non-null object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

### The number of 'NaN' we have in each column in our data

In [7]:
pay.isnull().sum()
# If we need sorted values!
#print(pay.isnull().sum().sort_values(ascending=False))

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

### Output the statistics for your dataset.

In [10]:
pay.describe(include = 'all')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

### What are the maximum, minimum and average Typical Hours? (use 'Typical Hours' column)

In [43]:
print('Max Typical Hours are ::', pay['Typical Hours'].max())
print('Min Typical Hours are ::', pay['Typical Hours'].min())
print('Mean/avg Typical Hours are ::', pay['Typical Hours'].mean())

Max Typical Hours are :: 40.0
Min Typical Hours are :: 10.0
Mean/avg Typical Hours are :: 34.69871876189268

### How many employees are on salary and how many are working on hourly basis?
Hint: Group the data on 'Salary or Hourly' column. Instead of whole dataset, you can take the single column as input as well.

In [44]:
pay.groupby('Salary or Hourly').count()

,Name,Job Titles,Department,Full or Part-Time,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
Salary or Hourly,,,,,,,,,
Hourly,7883,7883,7883,7883,7883,0,7883,0,7883
Salary,24775,24775,24775,24775,0,24775,0,24775,0

### Department having maximum number of employees.

In [45]:
pay['Department'].value_counts().head(2)

POLICE    12973
FIRE       4800
Name: Department, dtype: int64

### The number of employees on Salary and  on Hourly in the Police department.

In [46]:
pay[pay['Department'] == 'POLICE'].groupby('Salary or Hourly').count()['Department']

Salary or Hourly
Hourly       32
Salary    12941
Name: Department, dtype: int64

### The mean, max and min salaries.

In [47]:
pay['Salary'] = pay['Annual Salary'].str.replace('$', '').astype(float)

In [48]:
print('min:', pay['Salary'].min())
print('max:', pay['Salary'].max())
print('mean:', pay['Salary'].mean())

min: 0.96
max: 300000.0
mean: 87512.78024137241

In [49]:
pay.head(2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN

### Employee who has the maximum salary.

In [50]:
#pay[pay['Salary'] == pay['Salary'].max()]
pay.loc[pay['Salary'].idxmax()]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                      $300000.00
Hourly Rate                               NaN
Salary                                 300000
H_Rate                                    NaN
Name: 8310, dtype: object

### Find an employee who has the minimum salary

In [51]:
pay.loc[pay['Salary'].idxmin()]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                           $0.96
Hourly Rate                               NaN
Salary                                   0.96
H_Rate                                    NaN
Name: 15387, dtype: object

### What are the mean, max and min Hourly Rate?

we will use .str and replace()
we are going to create a new column name "H_Rate" and separate the number from dollar sign as float.

In [52]:
pay['H_Rate'] = pay['Hourly Rate'].str.replace('$', '').astype(float)

In [53]:
print('min:', pay['H_Rate'].min())
print('max:', pay['H_Rate'].max())
print('mean:', pay['H_Rate'].mean())

min: 2.65
max: 96.0
mean: 32.86819231257292

In [30]:
pay.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN

### How many employees are getting max Hourly Rate?

In [54]:
pay[pay['H_Rate'] == pay['H_Rate'].max()].count()

Name                 1
Job Titles           1
Department           1
Full or Part-Time    1
Salary or Hourly     1
Typical Hours        1
Annual Salary        0
Hourly Rate          1
Salary               0
H_Rate               1
dtype: int64

### Who is getting max Hourly Rate?

In [55]:
pay[pay['H_Rate'] == pay['H_Rate'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

### How many employees are earning less than the average Hourly Rate?

In [56]:
pay[pay['H_Rate'] < pay['H_Rate'].mean()].count()['H_Rate']

2791

###  The number of employees paided hourly having a full-time job?

In [57]:
pay[(pay['Hourly Rate'].notnull()) & (pay['Full or Part-Time'] =='F')].count(0)['Full or Part-Time']

5906

### Find the full-time employees who are working at hourly rate of $10.00?

In [61]:
pay[(pay['Full or Part-Time']=='F') &(pay['H_Rate']==10)]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_Rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

### How many unique Job Titles are there in the data?

In [63]:
pay['Job Titles'].nunique()

1095

### What was the average Salary of the employees in each department?

In [66]:
pay.groupby('Department').mean()['Salary']

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salary, dtype: float64

### The job title of 'AGAR, BULENT B'? There are two spaces between AGAR, and BULENT.

In [73]:
pay[pay['Name'] == 'AGAR,  BULENT B']['Job Titles']

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

### What are the top most common job titles?

In [74]:
pay['Job Titles'].value_counts().head()

POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: Job Titles, dtype: int64

### How many people have the word 'officer' in their job title?

In [75]:
def find_string(title):
    if 'officer' in title.lower():
        return True
    else:
        return False

In [76]:
sum(pay['Job Titles'].apply(lambda x: find_string(x)))

11101